{
    "0": {
      "pregunta": "Una interfaz web debe ser visual, es decir, su objetivo principal es conseguir que llame la atención. ¿Verdadero o falso?",
      "tipo": "radio",
      "respuestas": {
        "opcion_1": "Verdadero.",
        "opcion_2": "Falso."
      },
      "correcta": "Falso."
    },
    "1": {
      "pregunta": "En la implementación de un diseño Web el uso de lenguajes que cumplan con los estándares es importante porque garantiza...",
      "tipo": "radio",
      "respuestas": {
        "opcion_1": "La usabilidad.",
        "opcion_2": "La accesibilidad.",
        "opcion_3": "La continuidad.",
        "opcion_4": "La navegabilidad."
      },
      "correcta": "La continuidad."
    },
    "2": {
      "pregunta": "Para llegar a todo el mundo y hacer una interfaz más usable hay que tratar de:",
      "tipo": "checkbox",
      "respuestas": {
        "opcion_1": "Simplificar las frases.",
        "opcion_2": "Suprimir palabras inútiles.",
        "opcion_3": "Utilizar adornos literarios.",
        "opcion_4": "Utilizar un lenguaje de culto con estructuras complejas."
      },
      "correcta": "Simplificar las frases. y Suprimir palabras inútiles."
    },
    "3": {
      "pregunta": "En lo que respecta al desarrollo de interfaces, una de las directrices a tener en cuenta si queremos desarrollar una interfaz usable es:",
      "tipo": "radio",
      "respuestas": {
        "opcion_1": "Formar al usuario en el uso de la interfaz mediante un tutorial que se puede descargar de la página.",
        "opcion_2": "Dar respuesta inmediata a las acciones de los usuarios.",
        "opcion_3": "Informar al usuario de los errores cometidos."
      },
      "correcta": "Dar respuesta inmediata a las acciones de los usuarios."
    },
    "4": {
      "pregunta": "En lo que respecta al sistema de navegación y al sistema de búsqueda de una interfaz, son deseables las características:",
      "tipo": "radio",
      "respuestas": {
        "opcion_1": "Permanencia.",
        "opcion_2": "Constancia.",
        "opcion_3": "Persistencia y consistencia."
      },
      "correcta": "Persistencia y consistencia."
    },
    "5": {
      "pregunta": "Una página web usable es, además, siempre accesible. ¿Verdadero o falso?",
      "tipo": "radio",
      "respuestas": {
        "opcion_1": "Verdadero.",
        "opcion_2": "Falso."
      },
      "correcta": "Falso."
    },
    "6": {
      "pregunta": "El análisis heurístico debe ser realizado por un experto en accesibilidad. ¿Verdadero o falso?",
      "tipo": "radio",
      "respuestas": {
        "opcion_1": "Verdadero.",
        "opcion_2": "Falso."
      },
      "correcta": "Falso."
    },
    "7": {
      "pregunta": "¿Qué elementos hay que tener en cuenta cuando se realiza una prueba o test de usabilidad?",
      "tipo": "checkbox",
      "respuestas": {
        "opcion_1": "El momento en el que se realiza.",
        "opcion_2": "El lugar donde se realiza.",
        "opcion_3": "Que las preguntas del test estén bien redactadas.",
        "opcion_4": "La personas con las que se realiza."
      },
      "correcta": "El momento en el que se realiza., El lugar donde se realiza. y La personas con las que se realiza."
    },
    "8": {
      "pregunta": "Si queremos hacer un diseño pensando en el usuario, tendremos que tener en cuenta:",
      "tipo": "checkbox",
      "respuestas": {
        "opcion_1": "Sus características y su experiencia previa en el uso de la web.",
        "opcion_2": "Su titulación y sus habilidades manuales.",
        "opcion_3": "Sus capacidades, aptitudes y expectativas.",
        "opcion_4": "Sus limitaciones físicas y/o técnicas."
      },
      "correcta": "Sus características y su experiencia previa en el uso de la web., Sus capacidades, aptitudes y expectativas. y Sus limitaciones físicas y/o técnicas."
    },
    "9": {
      "pregunta": "A la hora de diseñar una interfaz para una web es importante que el formato del sitio web cumpla con las expectativas de los usuarios, en especial aquellos relacionados con:",
      "tipo": "checkbox",
      "respuestas": {
        "opcion_1": "La navegación.",
        "opcion_2": "El contenido.",
        "opcion_3": "Su atractivo visual.",
        "opcion_4": "La organización."
      },
      "correcta": "La navegación., El contenido. y La organización."
    },
    "10": {
      "pregunta": "Para lograr un acceso más eficiente y sencillo a la información de un sitio web es importante:",
      "tipo": "checkbox",
      "respuestas": {
        "opcion_1": "El número de páginas que componen el sitio sea reducido.",
        "opcion_2": "Tenga un sistema de búsqueda eficiente.",
        "opcion_3": "Una buena organización de los contenidos del sitio.",
        "opcion_4": "Un buen diseño del sistema de navegación."
      },
      "correcta": "Tenga un sistema de búsqueda eficiente., Una buena organización de los contenidos del sitio. y Un buen diseño del sistema de navegación."
    },
    "11": {
      "pregunta": "Como regla general, el nivel de habilidad de los usuarios según su conocimiento o experiencia se clasifica en tres niveles básicos:",
      "tipo": "radio",
      "respuestas": {
        "opcion_1": "Avanzado, intermedio, novato.",
        "opcion_2": "Avanzado, principiante, intermedio.",
        "opcion_3": "Experto, intermedio, inexperto.",
        "opcion_4": "Experto, principiante, inexperto."
      },
      "correcta": "Avanzado, principiante, intermedio."
    },
    "12": {
      "pregunta": "A la hora de usar la web, ¿cuáles son las preferencias de los usuarios, en general?",
      "tipo": "checkbox",
      "respuestas": {
        "opcion_1": "Les gustan aquellos párrafos en los que se concentra gran cantidad de información.",
        "opcion_2": "Les gusta las analogías visuales que les recuerdan cosas reales.",
        "opcion_3": "Prefieren el uso de una terminología sencilla.",
        "opcion_4": "No quieren tener sobrecarga de información."
      },
      "correcta": "Les gusta las analogías visuales que les recuerdan cosas reales., Prefieren el uso de una terminología sencilla. y No quieren tener sobrecarga de información."
    },
    "13": {
      "pregunta": "¿Cuáles de estos lenguajes son estándares que nos permiten asegurar la continuidad de un sitio web frente a posibles cambios en la tecnología?",
      "tipo": "checkbox",
      "respuestas": {
        "opcion_1": "UML.",
        "opcion_2": "HTML.",
        "opcion_3": "XHTML.",
        "opcion_4": "XML."
      },
      "correcta": "HTML., XHTML. y XML."
    },
    "14": {
      "pregunta": "La redacción de los contenidos deben ajustarse, en la medida de lo posible, a las siguientes características:",
      "tipo": "checkbox",
      "respuestas": {
        "opcion_1": "Utilizar siempre la misma palabra para denominar una misma cosa.",
        "opcion_2": "Evitar el uso de jergas, abreviaturas e iniciales y, si se hace uso de ellas, etiquetarlas adecuadamente en el código con las etiquetas ABBR y ACRONYM.",
        "opcion_3": "División del texto en varias secciones en caso de que éste sea extenso, de forma que se facilite la lectura.",
        "opcion_4": "Evitar poner contenidos que se presupone que los usuarios potenciales ya conocen."
      },
      "correcta": "Utilizar siempre la misma palabra para denominar una misma cosa., Evitar el uso de jergas, abreviaturas e iniciales y, si se hace uso de ellas, etiquetarlas adecuadamente en el código con las etiquetas ABBR y ACRONYM. y División del texto en varias secciones en caso de que éste sea extenso, de forma que se facilite la lectura."
    },
    "15": {
      "pregunta": "¿Cuáles de los siguientes son métodos para analizar la usabilidad de una interfaz?",
      "tipo": "checkbox",
      "respuestas": {
        "opcion_1": "Una encuesta entre la población antes de divulgar la página.",
        "opcion_2": "La evaluación heurística a cargo de una persona con experiencia en usabilidad.",
        "opcion_3": "Un test de usabilidad realizado con un grupo de usuarios.",
        "opcion_4": "La técnica Eye tracking."
      },
      "correcta": "La evaluación heurística a cargo de una persona con experiencia en usabilidad., Un test de usabilidad realizado con un grupo de usuarios. y La técnica Eye tracking."
    },
    "16": {
      "pregunta": "El diseño de interfaces gráficas de usuario es un caso concreto de diseño de interfaces web. ¿Verdadero o falso?",
      "tipo": "radio",
      "respuestas": {
        "opcion_1": "Verdadero.",
        "opcion_2": "Falso."
      },
      "correcta": "Falso."
    },
    "17": {
      "pregunta": "La navegación de un sitio web debe ser",
      "tipo": "radio",
      "respuestas": {
        "opcion_1": "Gráfica.",
        "opcion_2": "Compleja.",
        "opcion_3": "Simple.",
        "opcion_4": "Predecible."
      },
      "correcta": "Predecible."
    },
    "18": {
      "pregunta": "Algunas de las combinaciones de teclado que se usan para navegar por la web son:",
      "tipo": "checkbox",
      "respuestas": {
        "opcion_1": "ALT + D (para ir a la barra de direcciones).",
        "opcion_2": "ESC (para detener la descarga de una página).",
        "opcion_3": "CTRL + TAB (para retroceder entre los elementos de una página web).",
        "opcion_4": "TAB (para avanzar entre los distintos enlaces de una página web)."
      },
      "correcta": "ALT + D (para ir a la barra de direcciones)., ESC (para detener la descarga de una página). y TAB (para avanzar entre los distintos enlaces de una página web)."
    },
    "19": {
      "pregunta": "¿Qué Norma ISO define la usabilidad como un atributo de la calidad del software, asociado al diseño y a la evaluación de la interfaz de usuario y a la interacción?",
      "tipo": "radio",
      "respuestas": {
        "opcion_1": "ISO 9241-151.",
        "opcion_2": "ISO 13407.",
        "opcion_3": "ISO/DIS 9241-11.",
        "opcion_4": "ISO/IEC 9126."
      },
      "correcta": "ISO/IEC 9126."
    },
    "20": {
      "pregunta": "Facilitar la interactividad de los usuarios con el sitio web...",
      "tipo": "radio",
      "respuestas": {
        "opcion_1": "Es un objetivo de la web relacionado con la accesibilidad.",
        "opcion_2": "Es un objetivo de la web relacionado con la usabilidad.",
        "opcion_3": "Es un objetivo de la web relacionado con la creatividad.",
        "opcion_4": "Es un objetivo de la web relacionado con la navegación."
      },
      "correcta": "Es un objetivo de la web relacionado con la usabilidad."
    },
    "21": {
      "pregunta": "¿En qué Norma ISO se detallan los principios para el diseño de sitios web usables?",
      "tipo": "radio",
      "respuestas": {
        "opcion_1": "ISO 9241-151.",
        "opcion_2": "ISO TR 16982.",
        "opcion_3": "ISO TR 18529.",
        "opcion_4": "ISO/IEC 9126."
      },
      "correcta": "ISO 9241-151."
    },
    "22": {
      "pregunta": "¿Que directrices hay que tener en cuenta para desarrollar interfaces más usables?",
      "tipo": "checkbox",
      "respuestas": {
        "opcion_1": "Dar respuesta inmediata a las acciones de los usuarios.",
        "opcion_2": "Comprender el estado de ánimo de los usuarios.",
        "opcion_3": "Tratar los errores pero evitando que se produzcan.",
        "opcion_4": "Que el usuario sienta que tiene el control del sistema."
      },
      "correcta": "Dar respuesta inmediata a las acciones de los usuarios., Tratar los errores pero evitando que se produzcan. y Que el usuario sienta que tiene el control del sistema."
    },
    "23": {
      "pregunta": "Las respuestas negativas a las preguntas de una evaluación heurística son las que detectan problemas de usabilidad. ¿Verdadero o falso?",
      "tipo": "radio",
      "respuestas": {
        "opcion_1": "Verdadero.",
        "opcion_2": "Falso."
      },
      "correcta": "Verdadero."
    },
    "24": {
      "pregunta": "¿Qué metodos de análisis y evaluación de la usabilidad se complementan entre sí?",
      "tipo": "radio",
      "respuestas": {
        "opcion_1": "Test de usabilidad y técnica Eye tracking..",
        "opcion_2": "Evaluación heurística y técnica Eye tracking.",
        "opcion_3": "Evaluación heurística y encuesta después de su divulgación.",
        "opcion_4": "Evaluación heurística y test de usabilidad."
      },
      "correcta": "Evaluación heurística y test de usabilidad."
    },
    "25": {
      "pregunta": "¿En qué principios se basa el diseño de una interfaz web?",
      "tipo": "checkbox",
      "respuestas": {
        "opcion_1": "Dar el control al usuario.",
        "opcion_2": "Mantener una interfaz consistente.",
        "opcion_3": "Reducir la carga de memoria.",
        "opcion_4": "Hacer un diseño visual atractivo."
      },
      "correcta": "Dar el control al usuario., Mantener una interfaz consistente. y Reducir la carga de memoria."
    },
    "26": {
      "pregunta": "La __________ se emplea para evaluar cómo usan los usuarios la web.",
      "tipo": "radio",
      "respuestas": {
        "opcion_1": "técnica Eye tracking",
        "opcion_2": "evaluación heurística a cargo de una persona con experiencia en usabilidad",
        "opcion_3": "encuesta antes de la divulgación de la página",
        "opcion_4": "prueba o test de usabilidad antes de la divulgación de la página"
      },
      "correcta": "prueba o test de usabilidad antes de la divulgación de la página"
    },
    "27": {
      "pregunta": "La usabilidad es un atributo __________ que evalúa cuán fáciles son de usar las interfaces de usuario.",
      "tipo": "radio",
      "respuestas": {
        "opcion_1": "cuantitativo.",
        "opcion_2": "calificativo.",
        "opcion_3": "cualitativo.",
        "opcion_4": "estimativo."
      },
      "correcta": "cualitativo."
    },
    "28": {
      "pregunta": "¿Cuáles de los siguientes son objetivos de la web relacionados con la usabilidad?",
      "tipo": "checkbox",
      "respuestas": {
        "opcion_1": "Conseguir que toda la información relevante esté colocada en la página principal.",
        "opcion_2": "Permitir una búsqueda rápida, cómoda y eficiente de la información por parte de los usuarios.",
        "opcion_3": "Facilitar la navegación de los usuarios en el sitio web.",
        "opcion_4": "Conseguir que los usuarios puedan comunicarse con el diseñador de la interfaz."
      },
      "correcta": "Permitir una búsqueda rápida, cómoda y eficiente de la información por parte de los usuarios. y Facilitar la navegación de los usuarios en el sitio web."
    },
    "29": {
      "pregunta": "Cuando hablamos de __________ en un sistema de navegación, hacemos referencia a que sus elementos se colocan siempre en el mismo sitio en todas las páginas que componen un sitio web.",
      "tipo": "radio",
      "respuestas": {
        "opcion_1": "consistencia.",
        "opcion_2": "permanencia.",
        "opcion_3": "persistencia.",
        "opcion_4": "coherencia."
      },
      "correcta": "persistencia."
    },
    "30": {
      "pregunta": "Firefox permite habilitar el uso del teclado dentro de una web como si estuviéramos manejando un procesador de textos con la tecla de función:",
      "tipo": "radio",
      "respuestas": {
        "opcion_1": "F5.",
        "opcion_2": "F7.",
        "opcion_3": "F3.",
        "opcion_4": "F9."
      },
      "correcta": "F7."
    },
    "31": {
      "pregunta": "¿Qué parámetros se suelen observar cuando se realiza una evaluación heurística?",
      "tipo": "checkbox",
      "respuestas": {
        "opcion_1": "La consistencia.",
        "opcion_2": "Eficiencia y flexibilidad.",
        "opcion_3": "Ubicación y navegación.",
        "opcion_4": "La omisión de información sobre el tema del que trata el sitio."
      },
      "correcta": "La consistencia., Eficiencia y flexibilidad. y Ubicación y navegación."
    },
    "32": {
      "pregunta": "Para garantizar que se puede acceder a toda la información conviene comprobar que:",
      "tipo": "checkbox",
      "respuestas": {
        "opcion_1": "Todos los enlaces muestran el contenido que se esperaba.",
        "opcion_2": "No existen enlaces que no conducen a ninguna parte.",
        "opcion_3": "Todos los contenidos son accesibles ya sea desde el menú de navegación principal o desde alguno de los enlaces.",
        "opcion_4": "Los enlaces a contenidos que todavía no están preparados enlazan a una página con el texto 'En construcción'."
      },
      "correcta": "Todos los enlaces muestran el contenido que se esperaba., No existen enlaces que no conducen a ninguna parte. y Todos los contenidos son accesibles ya sea desde el menú de navegación principal o desde alguno de los enlaces."
    },
    "33": {
      "pregunta": "En el caso de diseñar varias interfaces para un mismo sitio web en función de si éste va a ser usado por perfiles de usuario distintos, tendremos que tener en cuenta la usabilidad...",
      "tipo": "radio",
      "respuestas": {
        "opcion_1": "Sólo en el perfil de invitado y en el de usuario registrado.",
        "opcion_2": "Sólo en el perfil de invitado o visitante.",
        "opcion_3": "En todos los perfiles de usuario.",
        "opcion_4": "Sólo en el perfil de administrador de la página."
      },
      "correcta": "En todos los perfiles de usuario."
    },
    "34": {
      "pregunta": "Cuando hablamos de __________ en un sistema de navegación, hacemos referencia a que sus elementos son coherentes en todas las páginas que componen un sitio web.",
      "tipo": "radio",
      "respuestas": {
        "opcion_1": "consistencia.",
        "opcion_2": "permanencia.",
        "opcion_3": "persistencia.",
        "opcion_4": "coherencia."
      },
      "correcta": "consistencia."
    },
    "35": {
      "pregunta": "La redacción de los contenidos deben ajustarse, en la medida de lo posible, a las siguientes características:",
      "tipo": "checkbox",
      "respuestas": {
        "opcion_1": "Uso de lenguaje sencillo y directo.",
        "opcion_2": "Empleo de palabras cortas.",
        "opcion_3": "Utilizar lenguaje figurativo o metafórico.",
        "opcion_4": "Dirigirse al usuario de forma directa y personal."
      },
      "correcta": "Uso de lenguaje sencillo y directo., Empleo de palabras cortas. y Dirigirse al usuario de forma directa y personal."
    },
    "36": {
      "pregunta": "Algunos elementos del sistema de navegación son:",
      "tipo": "checkbox",
      "respuestas": {
        "opcion_1": "El enlace a la página de contacto que suele ir colocado en el encabezado y/o pie de todas las páginas.",
        "opcion_2": "El logotipo de la empresa que suele ir colocado en el encabezamiento de todas las páginas.",
        "opcion_3": "El enlace al mapa del sitio que suele ir colocado en el encabezado y/o en el pie de todas las páginas.",
        "opcion_4": "Los enlaces a las secciones principales del sitio que suelen ir ubicadas en el encabezado de todas las páginas."
      },
      "correcta": "El logotipo de la empresa que suele ir colocado en el encabezamiento de todas las páginas., El enlace al mapa del sitio que suele ir colocado en el encabezado y/o en el pie de todas las páginas. y Los enlaces a las secciones principales del sitio que suelen ir ubicadas en el encabezado de todas las páginas."
    }
  }